#+TITLE: 2021-02-03
#+AUTHOR: Christopher James Hayward

* Benefits of Literate Programming

In the textbook [[file:../notes/thinking-in-cpp.org][Thinking in C++]], *Eckel* uses a custom system for extracting and building all of the source code examples from the text, this is prefaced in the section *Begin and end comment tags*. I beleive he could have benefited here from a [[file:../notes/literate-programming.org][Literate Programming]] environment, automating much of this work without polluting the source code with tags.

* DONE Dotfiles cleanup
CLOSED: [2021-02-03 Wed 15:51] SCHEDULED: <2021-02-03 Wed>

I want to re-organize my [[roam:Dotfiles][Dotfiles]], namely move all ~org~ related directories to a ~docs~ subdirectory.

#+begin_src emacs-lisp
dotfiles/home
#+end_src

#+RESULTS:
: ~/.emacs.d/
